/*
The MIT License (MIT)

Copyright (c) 2024 sigma-axis

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <cstdint>
#include <algorithm>
#include <memory>
#include <vector>
#include <forward_list>
#include <string>
#include <charconv>
#include <map>

#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#pragma comment(lib, "imm32")
#include <CommCtrl.h>
#pragma comment(lib, "comctl32")

#pragma warning(push)
#pragma warning(disable : 6387 26454)
#include <json.h>
#pragma warning(pop)

using byte = uint8_t;
#include <exedit.hpp>

////////////////////////////////
// 主要情報源の変数アドレス．
////////////////////////////////
inline constinit struct AviUtl110 {
	constexpr static int32_t build110 = 11003;
	bool init(HMODULE hinst, AviUtl::SysInfo const& si)
	{
		if (si.build != build110) return false;

		instance = hinst;
		font = si.hfont;
		init_pointers();

		return true;
	}

	HMODULE instance;
	HFONT font;

	// 任意フレーム数移動
	int32_t(*	frame_jump_distance)[4];	// 0x086424

	// 編集のレジューム機能を有効
	int32_t*	resume_enabled;				// 0x086268

	// 関連ウィンドウ同士を移動時にスナップする
	int32_t*	snaps_window;				// 0x086434

	// トラックバーでクリックした位置に直接移動する
	int32_t*	seeks_clicked_point;		// 0x086270

private:
	void init_pointers()
	{
		auto pick_addr = [aviutl_base = reinterpret_cast<uintptr_t>(instance)]
			<class T>(T& target, ptrdiff_t offset) { target = reinterpret_cast<T>(aviutl_base + offset); };

		pick_addr(frame_jump_distance,	0x086424);
		pick_addr(resume_enabled,		0x086268);
		pick_addr(snaps_window,			0x086434);
		pick_addr(seeks_clicked_point,	0x086270);
	}
} aviutl;

enum class time_fmt :int32_t {
	frame = 0,
	hms = 1,
};
inline constinit struct ExEdit092 {
	AviUtl::FilterPlugin* fp;
	constexpr static auto info_exedit092 = "拡張編集(exedit) version 0.92 by ＫＥＮくん";
	bool init(AviUtl::FilterPlugin* this_fp)
	{
		if (fp != nullptr) return true;

		AviUtl::SysInfo si; this_fp->exfunc->get_sys_info(nullptr, &si);
		if (!aviutl.init(this_fp->hinst_parent, si)) return false;

		for (int i = 0; i < si.filter_n; i++) {
			auto that_fp = this_fp->exfunc->get_filterp(i);
			if (that_fp->information != nullptr &&
				0 == std::strcmp(that_fp->information, info_exedit092)) {
				fp = that_fp;
				init_pointers();
				return true;
			}
		}
		return false;
	}

	int32_t*	is_playing;				// 0x1a52ec; 0: editing, 1: playing.

	time_fmt*	tl_time_format;			// 0x178e20
	time_fmt*	dlg_time_format;		// 0x14dec8

	void(*		update_dialog_top)();	// 0x02c580

	int32_t*	layer_size_mode;		// 0x1539d4; 0: large, 1: medium, 2: small.
	int32_t(*	layer_size_preset)[3];	// 0x0a3e08
	int32_t(*	midpt_mk_sz_preset)[3];	// 0x0a3e14
	int32_t*	layer_size;				// 0x0a3e20
	int32_t*	midpt_marker_size;		// 0x0a3e24

	int32_t*	playback_syncs_cursor;	// 0x158d14
	int32_t*	pos_green_line;			// 0x0a3fc0

	int32_t*	scroll_follows_cursor;	// 0x1790d0
	int32_t*	groups_drag_drop;		// 0x179224
	int32_t*	relocates_file_path;	// 0x177a20
	int32_t*	split_calcs_midvalue;	// 0x1460b0
	int32_t*	splits_at_current;		// 0x1538b0
	int32_t*	drags_adjacent_obj;		// 0x14ea00
	int32_t*	split_seps_groups;		// 0x153de0
	int32_t*	clamps_into_rgb_box;	// 0x1538b8

	int32_t*	auto_backup_enabled;	// 0x135aa8

private:
	void init_pointers()
	{
		auto pick_addr = [exedit_base = reinterpret_cast<uintptr_t>(fp->dll_hinst)]
			<class T>(T& target, ptrdiff_t offset) { target = reinterpret_cast<T>(exedit_base + offset); };

		pick_addr(is_playing,				0x1a52ec);

		pick_addr(tl_time_format,			0x178e20);
		pick_addr(dlg_time_format,			0x14dec8);

		pick_addr(update_dialog_top,		0x02c580);

		pick_addr(layer_size_mode,			0x1539d4);
		pick_addr(layer_size_preset,		0x0a3e08);
		pick_addr(midpt_mk_sz_preset,		0x0a3e14);
		pick_addr(layer_size,				0x0a3e20);
		pick_addr(midpt_marker_size,		0x0a3e24);

		pick_addr(playback_syncs_cursor,	0x158d14);
		pick_addr(pos_green_line,			0x0a3fc0);

		pick_addr(scroll_follows_cursor,	0x1790d0);
		pick_addr(groups_drag_drop,			0x179224);
		pick_addr(relocates_file_path,		0x177a20);
		pick_addr(split_calcs_midvalue,		0x1460b0);
		pick_addr(splits_at_current,		0x1538b0);
		pick_addr(drags_adjacent_obj,		0x14ea00);
